import React from 'react'
import {Div} from '@elements'
import {Table} from '@layouts'
import styles from '@styles/messages/messages.module.css'

const tempData = [
  {
    title: 'اطلاعیه',
    expand: 'به گزارش خبرگزاری صدا و سیما ، اپلیکیشن « کاراخوبه » در راستای مهارت محوری و اشتغال آفرینی، طی تفاهم نامه‌ای با سازمان آموزش فنی و حرفه‌ای' +
      'آماده خدمت رسانی به عموم مردم است . ',
    sendDate: '12 شهریور 1401',
    sendTime: '12:30',
  },
  {
    title: 'اطلاعیه',
    expand: 'به گزارش خبرگزاری صدا و سیما ، اپلیکیشن « کاراخوبه » در راستای مهارت محوری و اشتغال آفرینی، طی تفاهم نامه‌ای با سازمان آموزش فنی و حرفه‌ای' +
      'آماده خدمت رسانی به عموم مردم است . ',
    sendDate: '12 شهریور 1401',
    sendTime: '12:30',
  },
  {
    title: 'اطلاعیه',
    expand: 'به گزارش خبرگزاری صدا و سیما ، اپلیکیشن « کاراخوبه » در راستای مهارت محوری و اشتغال آفرینی، طی تفاهم نامه‌ای با سازمان آموزش فنی و حرفه‌ای' +
      'آماده خدمت رسانی به عموم مردم است . ',
    sendDate: '12 شهریور 1401',
    sendTime: '12:30',
  },
  {
    title: 'اطلاعیه',
    expand: 'به گزارش خبرگزاری صدا و سیما ، اپلیکیشن « کاراخوبه » در راستای مهارت محوری و اشتغال آفرینی، طی تفاهم نامه‌ای با سازمان آموزش فنی و حرفه‌ای' +
      'آماده خدمت رسانی به عموم مردم است . ',
    sendDate: '12 شهریور 1401',
    sendTime: '12:30',
  },
  {
    title: 'اطلاعیه',
    expand: 'به گزارش خبرگزاری صدا و سیما ، اپلیکیشن « کاراخوبه » در راستای مهارت محوری و اشتغال آفرینی، طی تفاهم نامه‌ای با سازمان آموزش فنی و حرفه‌ای' +
      'آماده خدمت رسانی به عموم مردم است . ',
    sendDate: '12 شهریور 1401',
    sendTime: '12:30',
  },
  {
    title: 'اطلاعیه',
    expand: 'به گزارش خبرگزاری صدا و سیما ، اپلیکیشن « کاراخوبه » در راستای مهارت محوری و اشتغال آفرینی، طی تفاهم نامه‌ای با سازمان آموزش فنی و حرفه‌ای' +
      'آماده خدمت رسانی به عموم مردم است . ',
    sendDate: '12 شهریور 1401',
    sendTime: '12:30',
  },
  {
    title: 'اطلاعیه',
    expand: 'به گزارش خبرگزاری صدا و سیما ، اپلیکیشن « کاراخوبه » در راستای مهارت محوری و اشتغال آفرینی، طی تفاهم نامه‌ای با سازمان آموزش فنی و حرفه‌ای' +
      'آماده خدمت رسانی به عموم مردم است . ',
    sendDate: '12 شهریور 1401',
    sendTime: '12:30',
  },
  {
    title: 'اطلاعیه',
    expand: 'به گزارش خبرگزاری صدا و سیما ، اپلیکیشن « کاراخوبه » در راستای مهارت محوری و اشتغال آفرینی، طی تفاهم نامه‌ای با سازمان آموزش فنی و حرفه‌ای' +
      'آماده خدمت رسانی به عموم مردم است . ',
    sendDate: '12 شهریور 1401',
    sendTime: '12:30',
  },
  {
    title: 'اطلاعیه',
    expand: 'به گزارش خبرگزاری صدا و سیما ، اپلیکیشن « کاراخوبه » در راستای مهارت محوری و اشتغال آفرینی، طی تفاهم نامه‌ای با سازمان آموزش فنی و حرفه‌ای' +
      'آماده خدمت رسانی به عموم مردم است . ',
    sendDate: '12 شهریور 1401',
    sendTime: '12:30',
  },
]

const tempDataHeader = {title: 'موضوع پیام', sendDate: 'تاریخ ارسال', sendTime: 'زمان ارسال'}
const tempDataMobile = {title: 'موضوع پیام', sendDate: 'تاریخ ارسال', sendTime: 'زمان ارسال', expand: 'متن پیام'}

const Messages = () => {

  return (
    <Div className={styles.wrapper}>
      <Table
        mobileHeader={tempDataMobile}
        expandable={true}
        expandableHeader={'وضعیت پیام'}
        expandKey={'expand'}
        actions={true}
        pagination={true}
        selectRows={true}
        header={tempDataHeader}
        data={tempData}
      />
    </Div>
  )
}

export default Messages